const fs = require('fs')

// write file

const text = 'Сер Джеймс Бонд (англ. James Bond), командер ВМФ Великої Британії, також відомий як «агент 007» — головний персонаж романів британського письменника Яна Флемінга про вигаданого \r\n агента MI-6. Здобув широку популярність після початку екранізації романів Флемінга. Серія фільмів про Джеймса Бонда іменується «бондіаною» і є однією з найбільш тривалих серій фільмів в історії. \r\n З 1962 по 2021 роки вийшли 25 фільмів. Серія принесла її творцям понад 7 млрд доларів США, ставши третім за успішністю кіносеріалом в історії. \r\n'

// write to file
const pathToFile = 'n1.txt'
//якщо цю операцію повторити, то текст буде дописано в кінець файлу
//fs.writeFileSync(pathToFile, text, {encoding: 'utf-8', flag: 'a'}) //відкрити файл для запису (додавання) даних - файл створиться, якщо немає, буде записаний текст з врахуванням переносів


//write array to file
const text2 = [
    'Сер Джеймс Бонд (англ. James Bond), командер',
    'ВМФ Великої Британії, також відомий як «агент 007»',
    'головний персонаж романів британського письменника Яна Флемінга'
]

fs.writeFileSync('n2.txt', text2.join('\r\n'), {encoding: 'utf8', flag: 'w'}) //якщо файл створиться, а якщо існує то перезапишиться
